ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_c29_rtint_stack_regs.xml
<module id="C29_RTINT_STACK" HW_revision="" description="C29 RTINT STACK Registers">
	<group id="C29_RTINT_STACK_RegisterFile0" name="C29_RTINT_STACK_RegisterFile0" instances="128" offset="0x0" instaddr="64">
		<register id="RTINT_STACK_DATA0" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="RTINT stack Data0">
			<bitfield id="RTINT_STACK_DATA0" description="RTINT stack data0" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA1" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="RTINT stack Data1">
			<bitfield id="RTINT_STACK_DATA1" description="RTINT stack data1" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA2" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="RTINT stack Data2">
			<bitfield id="RTINT_STACK_DATA2" description="RTINT stack data2" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA3" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="RTINT stack Data3">
			<bitfield id="RTINT_STACK_DATA3" description="RTINT stack data3" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA4" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="RTINT stack Data4">
			<bitfield id="RTINT_STACK_DATA4" description="RTINT stack data4" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA5" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="RTINT stack Data5">
			<bitfield id="RTINT_STACK_DATA5" description="RTINT stack data5" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA6" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="RTINT stack Data6">
			<bitfield id="RTINT_STACK_DATA6" description="RTINT stack data6" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA7" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="RTINT stack Data7">
			<bitfield id="RTINT_STACK_DATA7" description="RTINT stack data7" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_DATA8" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="RTINT stack Data8">
			<bitfield id="RTINT_STACK_DATA8" description="RTINT stack data8" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_ECC0" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="RTINT stack ECC0">
			<bitfield id="RTINT_STACK_ECC0" description="RTINT_STACK_ECC0" begin="7" end="0" width="8" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_ECC1" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="RTINT stack ECC1">
			<bitfield id="RTINT_STACK_ECC1" description="RTINT_STACK_ECC1" begin="7" end="0" width="8" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_ECC2" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="RTINT stack ECC2">
			<bitfield id="RTINT_STACK_ECC2" description="RTINT_STACK_ECC2" begin="7" end="0" width="8" rwaccess="RW"/>
		</register>
		<register id="RTINT_STACK_ECC3" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="RTINT stack ECC3">
			<bitfield id="RTINT_STACK_ECC3" description="RTINT_STACK_ECC3" begin="7" end="0" width="8" rwaccess="RW"/>
		</register>
	</group>
</module>
